import 'package:flutter/cupertino.dart';

const String aboutDescription =
    'المدونات، هي جهودة جمع من تلامذه العلامه الشيخ السيد بدر السادات إبراهيم الخليل البخاري حفظه الله تعالى، حيث بذلوا أوقاتهم لتدوين جميع نكت التي يلقي الشيخ بنفسه في الدرس. وقسم المرتبون مواضيع الدرس إلى ثلاثة عشر قسما من فن الحديث والتاريخ والتفسير والفوائد العامة وغيرها ، حيث عين لكل قسم أميرا حاذقا ماهرا فيه . وها هنا نقدم لكم هذا التطبيق جامعا على تلك المعلومات بحسن النظام وفائق الشكل . جزى الله عن جميع من ساهم حظهم في الجمع والترتيب وانشاء التطبيق وغيرها ، ونفع الله به الأمة جميعا مستخدميهم ولكل من يقرأ هذه المدوناتت   ';
const String mainHeading = '_أصحاب التدوين_';
const String mainSubhead = 'الفرق';
const String ameerHead = 'الأمير';
const String ameerData = 'عادل اريكوت';
const String head1 = 'المرتبون';
const String text1 =
    'عادل أريكوت  \n أحمد سعيد فننغاتور \n محمد أويس شيرتوروتي \n محمد منصور فينيور \n محمد عبد الحكيم آتيري';

const String head2 = 'علوم القرآن';
const String text2 =
    'السيد أحمد الكبير البخاري كدالوندي \n محمد عبد الحكيم آتيري \n محمد إرشاد كونوم فارى';

const String head3 = 'علم الحديث';
const String text3 =
    'لسيد شهاب الدين وياناد \n محمد قاسم كوتي شيرا \n محمد سلمان فانيانبلم \n فارس رحمان فوكلتور \n محمد مبشر أوتوكونكل';

const String head4 = 'علم الفقه';
const String text4 = 'محمد منصور فينيور \n محمد سهل مونغم \n محمد صادق فيّاناد';
const String head5 = 'الفكر';
const String text5 =
    'مبتسم فافينيفارا \n أحمد صفوان مدينة الصلاة \n محمد صفوان ترورنغادي \n محمد أنيس فتافريم';
const String head6 = 'مثل';
const String text6 =
    'محمد سهيل كروكتاني \n محمد سلمان الفايس كونبدي \n محمد إقبال رنداتاني';
const String head7 = 'اللغة';
const String text7 =
    'محمد نصيب كادانبوزا \n محمد أويس أزكور \n محمد سلمان نليكوت \nفضل';
const String head8 = 'الفوائد العامة';
const String text8 =
    'محمد سعيد كندوتي \nمحمد إسحاق آلوا \n محمد سفيان مدينة الصلاة \n محمد جابر فوليامبرنب';
const String head9 = 'تجربة';
const String text9 =
    'محمد نهاد كندوتي \n السيد سلمان الفارس كريفور \n محمد علي جوهر تانور  \n محمد مقداد مانبزا \n فضل الرحمن آلووا \n شميم كييوفارانب';
const String head10 = 'التراجم والطبقات';
const String text10 =
    'أحمد سعيد فنغاتور \n آسف المعيني \n محي الدين كوتوبادم \n حبيب الرحمن فتوفرمب';
const String head11 = 'الوصايا والنصائح';
const String text11 =
    'محمد أويس شيرتوروتي \n محمد شعيب ألنلور \n عاشق فارانبيل فيدكا \n محمد أسلم مانور';
const String head12 = 'علم العقيدة';
const String text12 =
    'محمد صلاح الدين واداتفارا \n محمد سهيل مونغم \n شهير أنس أيكارافادي \n شهير فولاماندول';
const String head13 = 'المعارف العامة';
const String text13 =
    'أحمد أويس القرني نيرولفالام \n إسماعيل تلاكدتور \n محمد صفوان كوندور \n بشر الحافي فانديكاد';
const String head14 = 'علم التاريخ والسيرة';
const String text14 =
    'محمد مصطفى وينغيرا \n محمد أسعد وفا فيليفرام \n محمد مبشر تينيلا \n محمد أويس وزكدو';
const String head15 = 'التصميم';
const String text15 = 'محمد سعيد أومشافوزا \n محمد جابر فناني';
const String head16 = 'تطبيق';
const String text16 =
    'محمد سهل آدرشيري \n محمد عدنان فانغ  \n محمد شبل أيرمافيتي';

const headingStyle = TextStyle(fontSize: 18, fontWeight: FontWeight.bold);
